app/Controllers/Login.php

SELECT *
FROM `users`
WHERE `username` = 'aficahya'
 LIMIT 1
---
    public function process()
    {
        $users = new UsersModel();
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');
        $dataUser = $users->where(['username' => $username,])->first();