app/Controllers/Mahasiswa.php

SELECT *
FROM `mahasiswa`
 LIMIT 5, 5
SELECT COUNT(*) AS `numrows`
FROM `mahasiswa`
---
    public function index()
    {
        $pager = \Config\Services::pager();
        $keyword = $this->request->getVar('keyword');
        if ($keyword) {
            $index = $this->mahasiswa->search($keyword);
        } else {
            $index = $this->mahasiswa;
        }
        $data = [
            'mahasiswa'   => $this->mahasiswa->paginate(5, 'datamahasiswa'),
            'pager'         => $this->mahasiswa->pager,
        ];